import { PrismaClient } from '@prisma/client';

const prisma = new PrismaClient();

async function main() {
    console.log('Починаємо заповнення бази даних SEHub... ');

    await prisma.discovery.deleteMany();

    const discoveries = [
        {
            title: 'Орбітальний телескоп «Кеплер»',
            description: 'космічний телескоп НАСА, призначений для пошуків екзопланет. Названий на честь Йоганна Кеплера (1571—1630), німецького філософа, математика, астронома, астролога і оптика.\n' +
                '\n' +
                'Первинний підрядник — «Ball Aerospace & Technologies». Телескоп був запущений 7 березня 2009 з космодрому на мисі Канаверал в штаті Флорида.[1] На орбіту апарат вивела ракета-носій Delta II. Двічі, в січні 2006 і в березні 2006 року запуск відкладався через фінансові проблеми. Оцінена вартість запуску місії складала приблизно 467 мільйонів доларів. Спочатку місія була розрахована на 3,5 роки, але згодом її продовжили. У 2015 році допоміг знайти екзопланету K2-18b, що як пізніше виявилося, знаходиться у зоні, придатній до життя, та у атмосфері якої є значна кількість водяної пари',
            category: 'Телескопи',
        },
        {
            title: 'Юпітер',
            description: 'п\'ята від Сонця та найбільша планета Сонячної системи[6]. Відстань Юпітера від Сонця змінюється в межах від 4,95 до 5,45 а. о. (740—814 млн км), середня відстань становить 5,203 а. о. (778 млн км). Разом із Сатурном Юпітер класифікують як газового гіганта. Орбітальний період планети становить 11,862 років, синодичний — 466,72 діб.\n' +
                '\n' +
                'Маса Юпітера більш ніж удвічі перевищує масу усіх планет Сонячної системи разом узятих та в 318 разів більша за масу Землі[7], але цього недостатньо для перетворення на зорю, подібну Сонцю. В такому випадку його маса мала б бути в 1000 разів більшою, і навіть для перетворення на червоного карлика потрібне збільшення маси щонайменше у 80 разів[10][11]. Втім, Юпітер, через механізм Кельвіна — Гельмгольца, випромінює теплову енергію, еквівалентну 4·1017 Вт[12], що приблизно вдвічі перевищує енергію, яку ця планета отримує від Сонця',
            category: 'Планети',
        },
        {
            title: 'Ганімед',
            description: 'природний супутник Юпітера, найбільший та наймасивніший у Сонячній системі. Це єдиний супутник зі значним магнітним полем, що не має повноцінної атмосфери. Як і Титан, найбільший супутник Сатурна, він більший за планету Меркурій, але має меншу поверхневу гравітацію, ніж Меркурій, Іо або Місяць, через порівняно низьку щільність[4].',
            category: 'Супутники',
        },
        {
            title: 'Титан',
            description: 'найбільший супутник Сатурна, другий за розміром у Сонячній системі. Другий за віддаленістю серед семи гравітаційно округлих супутників Сатурна. Єдиний супутник у Сонячній системі, який має щільну атмосферу, що складається переважно з азоту й метану[3], а також єдине місце, окрім Землі, де знайдено рідини у формі морів, озер та річок.\n' +
                '\n' +
                'Титан відкрив 1655 року астроном Християн Гюйгенс[4], який досліджував кільця Сатурна за допомогою телескопа. В 1944 році встановили, що супутник має щільну атмосферу[5]. Впродовж наступних десятиліть він досліджувався за допомогою космічного телескопа «Габбл» та космічних апаратів «Піонер-11», «Вояджер-1» та «Кассіні». У 2005 році на поверхню Титану сів зонд «Гюйгенс», що зробило його другим природним супутником у Сонячній системі, на який здійснили посадку космічні апарати',
            category: 'Супутники',
        },
        {
            title: 'Місія Artemis II успішно завершена',
            description: 'Третій політ корабля Оріон та перша його пілотована місія, запущена ракетою Space Launch System. Ця місія є частиною програми NASA «Артеміда». Під час польоту досягнуто ряд рекордів, пов\'язаних з космонавтикою, зокрема під час цього польоту досягнуто найдальшої відстані людини від Землі за всю історію космонавтики[5] (406 000 км, що на ~7000 км далі, ніж попередній рекорд), а також уперше жінка та чорношкірий чоловік покинули межі земної орбіти. Крім цього, це перша місія поза земною орбітою з екіпажем у 4 особи, перший візит неамериканця поза земну орбіту (канадець Джеремі Гансен) і перша місія поза земну орбіту з лазерним космічним зв\'язком.',
            category: 'Місії',
        }
    ];

    for (const d of discoveries) {
        const record = await prisma.discovery.create({
            data: d,
        });
        console.log(`Додано відкриття: ${record.title}`);
    }

    console.log('Базу даних успішно заповнено космічними даними!');
}

main()
    .catch((e) => {
        console.error(e);
        process.exit(1);
    })
    .finally(async () => {
        await prisma.$disconnect();
    });